
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0]
  * module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0]
* Update
  * azurerm_key_vault_secret.update-summary-tab-cron
  * module.fpl-action-group.azurerm_resource_group_template_deployment.action-group
* Delete
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.update-summary-tab-cron will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update-summary-tab-cron" {
        id                      = "https://fpl-aat.vault.azure.net/secrets/update-summary-tab-cron/610e9d1fb33f446c9b8ee86a6a49b90b"
        name                    = "update-summary-tab-cron"
      - not_before_date         = "2023-11-22T08:32:40Z" -> null
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_activity_log_alert" "main" {
      - description         = "Monitors for application insight reaching it's daily cap." -> null
      - enabled             = true -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - fpl-case-service-appinsights-aat" -> null
      - location            = "global" -> null
      - name                = "Application Insights daily cap reached - fpl-case-service-appinsights-aat" -> null
      - resource_group_name = "fpl-case-service-aat" -> null
      - scopes              = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Insights/components/fpl-case-service-appinsights-aat",
        ] -> null
      - tags                = {
          - "application"         = "family-public-law"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/fpl-ccd-configuration.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#fpla-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Family Public Law"
        } -> null

      - action {
          - action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts" -> null
          - webhook_properties = {
              - "from"           = "terraform"
              - "slackChannelId" = null
            } -> null
        }

      - criteria {
          - category                = "Administrative" -> null
          - level                   = "Warning" -> null
          - levels                  = [] -> null
          - operation_name          = "Microsoft.Insights/Components/DailyCapReached/Action" -> null
          - resource_groups         = [] -> null
          - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Insights/components/fpl-case-service-appinsights-aat" -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (9 unchanged attributes hidden)
        }
    }

  # module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "main" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Monitors for application insight reaching it's daily cap."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "westeurope"
      + name                                   = "Application Insights daily cap reached - fpl-case-service-appinsights-aat"
      + resource_group_name                    = "fpl-case-service-aat"
      + scopes                                 = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod",
        ]
      + severity                               = 4
      + tags                                   = {
          + "application"         = "family-public-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fpl-ccd-configuration.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fpla-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Family Public Law"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups     = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts",
            ]
          + custom_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureActivity 
                  | where ResourceId == "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Insights/components/fpl-case-service-appinsights-aat"
                  | where OperationNameValue == "Microsoft.Insights/Components/DailyCapReached/Action"
                  | where Level == "Warning"
                  | where Category == "Administrative"
                  | where TimeGenerated > ago(1d)
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0] will be created
  + resource "null_resource" "fix_scheduled_query_rules_alert_v2" {
      + id       = (known after apply)
      + triggers = {
          + "alert_id" = (known after apply)
        }
    }

  # module.fpl-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Resources/deployments/fpl-support"
        name                     = "fpl-support"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":5510,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->